using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WindowsFormsApplication3
{
    class Const
    {
        public static List<Dictionary<string, string>> CmdList()
        {
            List<Dictionary<string, string>> cmdlist = new List<Dictionary<string, string>>();

            Dictionary<string, string> data = new Dictionary<string, string>();
            data.Add("cmdname", "1.主站通信测试 功能码(3001) 主站->物联网表");
            data.Add("cmds2c", "68|0000|3001|00|00|00002306000001|00000000000001|0007|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|CRC16校验码|结束符");
            data.Add("cmdc2s", "68|0000|3001|01|01|00002306000001|00000000000001|0009|0000|00002306000001|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "2.物联网表通信测试 功能码(3002) 物联网表->主站");
            data.Add("cmdc2s", "68|0000|3002|01|00|00002306000001|00000000000001|0007|00002306000001|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|CRC16校验码|结束符");
            data.Add("cmds2c", "68|0000|3002|00|01|00002306000001|00000000000001|0009|0000|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "3.心跳包 功能码(3003) 物联网表->主站");
            data.Add("cmdc2s", "68|0000|3003|01|00|00002306000001|00000000000001|0007|00002306000001|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|CRC16校验码|结束符");
            data.Add("cmds2c", "68|0000|3003|00|01|00002306000001|00000000000001|0011|0000|00002306000001|00000000|00000000|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|标准日期|标准时间|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "4.注册包 功能码(3004) 物联网表->主站");
            data.Add("cmdc2s", "68|0000|3004|01|00|00002306000001|00000000000001|0007|00002306000001|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|CRC16校验码|结束符");
            data.Add("cmds2c", "68|0000|3004|00|01|00002306000001|00000000000001|0009|0000|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "5.物联网表上主动抄表 功能码(3042) 主站->物联网表");
            data.Add("cmds2c", "68|0000|3042|00|00|00002306000001|00000000000001|0007|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|CRC16校验码|结束符");
            data.Add("cmdc2s", "68|0000|3042|01|01|00002306000001|00000000000001|0017|0000|00002306000001|20150701|180000|000000010001|01|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|抄表日期|抄表时间|表具指数|阀门状态|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "6.物联网表下主动抄表 功能码(3043) 物联网表->主站");
            data.Add("cmdc2s", "68|0000|3043|01|00|00002306000001|00000000000001|0015|00002306000001|20150701|180000|000000010001|01|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|抄表日期|抄表时间|表具指数|阀门状态|CRC16校验码|结束符");
            data.Add("cmds2c", "68|0000|3043|00|01|00002306000001|00000000000001|0009|0000|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "7.物联网表开阀 功能码(3051) 主站->物联网表");
            data.Add("cmds2c", "68|0000|3051|00|00|00002306000001|00000000000001|0007|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|CRC16校验码|结束符");
            data.Add("cmdc2s", "68|0000|3051|01|01|00002306000001|00000000000001|0009|0000|00002306000001|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "8.单表关阀 功能码(3052) 主站->物联网表");
            data.Add("cmds2c", "68|0000|3052|00|00|00002306000001|00000000000001|0007|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|CRC16校验码|结束符");
            data.Add("cmdc2s", "68|0000|3052|01|01|00002306000001|00000000000001|0009|0000|00002306000001|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|CRC16校验码|结束符");
            cmdlist.Add(data);

            data = new Dictionary<string, string>();
            data.Add("cmdname", "9.表具异常事件上传 功能码(3062) 物联网表->主站");
            data.Add("cmdc2s", "68|0000|3062|01|00|00002306000001|00000000000001|0012|00002306000001|20150701|180000|1001|0000|16");
            data.Add("cmdc2sformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|物联网表编号|发生日期|发生时间|异常类型|CRC16校验码|结束符");
            data.Add("cmds2c", "68|0000|3062|00|01|00002306000001|00000000000001|0009|0000|00002306000001|0000|16");
            data.Add("cmds2cformat", "开始符|报文长度|功能码|传送方向|请求响应标识|物联网表编号|报文ID|数据域长度|响应码|物联网表编号|CRC16校验码|结束符");
            cmdlist.Add(data);

            return cmdlist;
        }


    }
}